/* 
   Error.strings
   BluetoothRemoteFramework

   Created by Marcel Erz on 8/14/08.
   Copyright 2008 Eliah Project. All rights reserved.
 */

// Inquiry
"1" = "Search already in progress.";
"2" = "No object to notify about new devices.";
"3" = "Failed to start inquiry.";
"4" = "Start of search denied.";
"5" = "No search is running.";
"6" = "Couldn't stop search.";
"8" = "Please turn on bluetooth.";
"9" = "Could not connect to device '%@'."
"10" = "Device is not connected. Cannot add it to the auto-connect list."
"11" = "Device is not connected. Cannot remove it from the auto-connect list."
"12" = "Cannot add device to the auto-connect list. It exists already."
"13" = "Cannot add address to the auto-connect list. It exists already."
"14" = "Cannot remove device from the auto-connect list. It doesn't exists in the list."
"15" = "Cannot remove address from the auto-connect list. It doesn't exists in the list."

// BluetoothRemoteDevice
"50" = "Couldn't connect to the device.";
"51" = "Device is not initialized.";
"52" = "Could not open connection to device '%@'.";
"53" = "Could not request device information from '%@'.";
"54" = "Could not disconnect from device '%@'.";
"55" = "Could not open channel %d.";
"56" = "Could not disconnect channel.";
"57" = "Could not send data.";

// Wiimote
"100" = "Led index %d is not possible.";
"101" = "Still waiting for reply of previous reading at %d.";
"102" = "Read from read-only address %d.";
"103" = "Address %d does not exist.";
"104" = "Received unknown data from EEPROM.";
"105" = "Received unknown type of data.";
"106" = "Unknwon IR-format with size %d.";

// BDRemote
"150" = "Received data package with not support length of %d.";
"151" = "Button %d is unknown.";
"152" = "Unknown button number requested (%d).";
